---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsPathStartExtension
source: html/e74e15f4-8be6-c8af-1f74-428838cc46f0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsPathStartExtension Property

"Start Extension"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsPathStartExtension { get; }
```